# Electrical Per Phase Data Current Phase C Property

Source: https://www.revitapidocs.com/2026/3fbed83c-8c43-7222-55de-9eac4da6796b.htm

---

| Electrical Per Phase Data Current Phase C Property |
| --- |

The effective value of current on electrical phase C.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double CurrentPhaseC { get; }
```

```
Public ReadOnly Property CurrentPhaseC As Double
	Get
```

```
public:
property double CurrentPhaseC {
	double get ();
}
```

```
member CurrentPhaseC : float with get
```

#### Property Value

Double See Also

#### Reference

ElectricalPerPhaseData Class Autodesk.Revit.DB.Electrical Namespace